cask_args appdir: '/Applications'

tap 'homebrew/bundle'

tap 'ethereum/ethereum'

brew 'zsh'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'mysql'
brew 'ruby-build'
brew 'rbenv'
brew 'node-build'
brew 'nodenv'
brew 'wget'
brew 'youtube-dl'
brew 'autojump'
brew 'mobile-shell'
brew 'ethereum'
brew 'solidity'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ipfs'

cask 'iterm2'
cask 'vagrant'
cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'skype'
cask 'caffeine'
cask 'dash'
cask 'evernote'
cask 'dropbox'
cask 'spotify'
cask 'transmit'
cask 'virtualbox'
cask 'colloquy'
cask 'macvim'
cask 'viscosity'
cask 'little-snitch'
cask 'tripmode'
cask 'wkhtmltopdf'
cask 'psequel'
