cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'coreutils'
brew 'go'
brew 'imagemagick'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'ruby-build'
brew 'rbenv'
brew 'node-build'
brew 'nodenv'
brew 'wget'
brew 'youtube-dl'
brew 'autojump'

cask 'iterm2'
cask 'vagrant'
cask '1password'
cask 'adium'
cask 'atom'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'skype'
cask 'caffeine'
cask 'dash'
cask 'evernote'
cask 'dropbox'
cask 'spotify'
cask 'transmit'
cask 'virtualbox'
cask 'colloquy'
cask 'macvim '
